---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.UnboundedHeight
source: html/c43c5fe9-8cfe-b120-48ac-79ade7c9c82b.htm
---
# Autodesk.Revit.DB.Mechanical.Space.UnboundedHeight Property

Get the Unbounded Height of the Space.

## Syntax (C#)
```csharp
public double UnboundedHeight { get; }
```

## Remarks
This property is used to get the Unbounded Height of the Space.